app/views/parties/show.html.erb

                                  <div class="chat-message">
                                    <% if @party.songs.count > 0%>
---
SELECT COUNT(*) FROM "songs" INNER JOIN "party_songs" ON "songs"."id" = "party_songs"."song_id" WHERE "party_songs"."party_id" = ?  [["party_id", 5]]