app/controllers/parties_controller.rb

SELECT "parties".* FROM "parties"  WHERE "parties"."user_id" = 2
---
  def index
    @party = Party.new
    @parties = Party.where("user_id" => current_user)

INSERT INTO "parties" ("code", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["code", "NTZA1"], ["created_at", "2014-08-27 20:14:57.077222"], ["name", "123"], ["updated_at", "2014-08-27 20:14:57.077222"], ["user_id", 1]]
---
  def create
    @party = Party.new(party_params)
    uid = current_user.uid
    name = params[:party][:name]
    token = current_user.token
    spotify_data = Party.create_party(uid, name, token)

SELECT  "parties".* FROM "parties"  WHERE "parties"."code" = 'PE7E6' LIMIT 1
SELECT "songs".* FROM "songs" INNER JOIN "party_songs" ON "songs"."id" = "party_songs"."song_id" WHERE "party_songs"."party_id" = ?  ORDER BY "songs"."votes" DESC  [["party_id", 5]]
---
  def show
    if params["party_code"]
      @party = Party.find_by(:code => params["party_code"])
    else
      @party = Party.find_by(:code => params["code"])
    end

    track_song = params[:q1]
    track_artist = params[:q2]
    if track_song || track_artist
      @search_results = Song.search_spotify(track_song, track_artist)
    end

    @track = params[:song_to_add]
    @songs = @party.songs.order(votes: :desc)

SELECT  "parties".* FROM "parties"  WHERE "parties"."code" = 'PE7E6' LIMIT 1
---
  def join_party
    binding.pry
    code = params[:code]
    if Party.find_by(:code => code)