app/controllers/songs_controller.rb

SELECT  "parties".* FROM "parties"  WHERE "parties"."code" = 'Q0BH5' LIMIT 1
SELECT  "songs".* FROM "songs"  WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "updated_at" = ?, "votes" = ? WHERE "songs"."id" = 1  [["updated_at", "2014-08-24 20:42:41.627306"], ["votes", 1]]
---
  def up_vote
    @party = Party.find_by(:code => params[:code])
    @song = Song.find(params[:song_id])
    @song.votes += 1
    @song.save